---
kind: method
id: M:Autodesk.Revit.DB.WorksetTable.GetActiveWorksetId
source: html/4755e6d9-c31c-32cc-7cf5-aac19dc12dff.htm
---
# Autodesk.Revit.DB.WorksetTable.GetActiveWorksetId Method

Returns the active workset's WorksetId.

## Syntax (C#)
```csharp
public WorksetId GetActiveWorksetId()
```

## Returns
WorksetId of the active workset.